reggie-hammer/load_test.yml
config:
  target: 'http://116.203.152.53'
  payload:
    path: "users.csv"
    order: sequence
    fields:
      - "username"
      - "password"
      - "email"
  phases:
    - duration: 10
      arrivalRate: 20
      name: "Warm Up"
scenarios:
  - flow:
      - post:
          url: "/api/auth/jwt/create"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            json: "$.access"
            as: "token"
      - log: "Token retrieved as  {{ username}}: {{ token }}"
      - get:
          url: "/api/conventions/"
          capture:
            json: "$[0].url"
            as: "url"
          headers:
            Authorization: "Bearer {{ token }}"
      - log: "URL for {{ username}} is {{ url }}. Token {{ token }}"
      - post:
          url: "/api/registrations/"
          json:
            convention: "{{ url }}"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.url"
            as: reg
      - log: "registered {{ username }} to reg {{ reg }}"