reggie-hammer/load_test.yml
config:
  target: 'http://localhost:8000'
  payload:
    path: "users.csv"
    order: sequence
    fields:
      - "username"
      - "password"
      - "email"
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Warm Up"
scenarios:
  - flow:
      - post:
          url: "/api/auth/jwt"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            json: "$.token"
            as: "token"
      - log: "Token retrieved as  {{ username}}: {{ token }}"
      - get:
          url: "/api/conventions/"
          capture:
            json: "$[0].url"
            as: "url"
          headers:
            Bearer: "{{ token }}"
      - log: "URL for {{ username}} is {{ url }}. Token {{ token }}"
      - post:
          url: "/api/registrations/"
          json:
          convention: "{{ url }}"
          headers:
            Bearer: "{{ token }}"